{
    "resorts": [
        {
            "name": "Disneyland Resort",
            "description": "The Disneyland Resort, commonly known as Disneyland, is an entertainment resort in Anaheim, California. It is owned and operated by The Walt Disney Company through its Parks, Experiences and Products division and is home to two theme parks (Disneyland Park and Disney California Adventure), three hotels, and a shopping, dining, and entertainment district known as Downtown Disney. The resort was developed by Walt Disney in the 1950s. When it opened to guests on July 17, 1955, the property consisted of Disneyland, its 100-acre parking lot (which had 15,167 spaces),[1] and the Disneyland Hotel, owned and operated by Disney's business partner Jack Wrather. After the success with the multi-park, multi-hotel business model at Walt Disney World in Lake Buena Vista, Florida, Disney acquired large parcels of land adjacent to Disneyland to apply the same business model in Anaheim. ",
            "imageUrl": "https://raw.githubusercontent.com/howardnguyen714/mouser/main/src/images/disneyland-resort-entrance.jpg",
            "tags": [
                {"text": "All ages", "upvotes": 0}
            ],
            "tips": [
                {"text": "Best theme park in SoCal!", "upvotes": 0},
                {"text": "If your kids like the trams, try to park at the Mickey and Friends Parking Structure.", "upvotes": 0}
            ],
            "parks": [
            ],
            "hotels": [            
            ],
            "shoppingDistricts": [
            ],
            "surroundingAreas": [                
            ]
        }
    ],
    "parks": [
        {
            "name": "Disneyland Park",
            "description": "Disneyland Park, originally Disneyland, is the first of two theme parks built at the Disneyland Resort in Anaheim, California, opened on July 17, 1955. It is the only theme park designed and built to completion under the direct supervision of Walt Disney. It was originally the only attraction on the property; its official name was changed to Disneyland Park to distinguish it from the expanding complex in the 1990s. It was the first Disney theme park. Walt Disney came up with the concept of Disneyland after visiting various amusement parks with his daughters in the 1930s and 1940s. He initially envisioned building a tourist attraction adjacent to his studios in Burbank to entertain fans who wished to visit; however, he soon realized that the proposed site was too small. After hiring a consultant to help him determine an appropriate site for his project, Disney bought a 160-acre (65 ha) site near Anaheim in 1953. Construction began in 1954 and the park was unveiled during a special televised press event on the ABC Television Network on July 17, 1955. Since its opening, Disneyland has undergone expansions and major renovations, including the addition of New Orleans Square in 1966, Bear Country (now Critter Country) in 1972, Mickey's Toontown in 1993, and Star Wars: Galaxy's Edge in 2019.",
            "imageUrl": "https://raw.githubusercontent.com/howardnguyen714/mouser/main/src/images/disneyland-park-castle.jpg",
            "tags": [
                {"text": "Best for young kids", "upvotes": 0},
                {"text": "Crowded", "upvotes": 0},
                {"text": "Classic", "upvotes": 0}
            ],
            "tips": [
                {"text": "If you're one of the first in the park in the morning, go to rides like Splash Mountain, Space Mountain, or Big Thunder Mountain Railroad! Their lines get really long later.", "upvotes": 0},
                {"text": "Get the extra Magic Hour if you're coming from far away!", "upvotes": 0},
                {"text": "Highly recommend Mickey's Halloween Party! I go every year :)", "upvotes": 0}
            ],
            "lands": []          
        },
        {
            "name": "Disney California Adventure Park",
            "description": "Disney California Adventure Park, commonly referred to as Disney California Adventure, California Adventure, or DCA, is a theme park located in Anaheim, California. It is owned and operated by The Walt Disney Company through its Parks, Experiences and Products division. The 72-acre (29 ha) park is themed after the history and culture of California, which celebrates the fun and adventure of the state through the use of various Disney, Pixar and Marvel properties. The park opened on February 8, 2001 as Disney's California Adventure Park or Disney's California Adventure, and it is the second of two theme parks built at the Disneyland Resort complex, after Disneyland Park.",
            "imageUrl": "https://raw.githubusercontent.com/howardnguyen714/mouser/main/src/images/disney-california-adventure-park-ferriswheel.jpg",
            "tags": [
                {"text": "Many thrill rides", "upvotes": 0},
                {"text": "Spacious", "upvotes": 0},
                {"text": "Unique", "upvotes": 0}
            ],
            "tips": [
                {"text": "If you're one of the first in the park in the morning, go to rides like Radiator Springs Racers, Guardians of the Galaxy: Mission Breakout, or Toy Story Midway Mania! Their lines get really long later.", "upvotes": 0},
                {"text": "If you have a park hopper ticket, go to Disneyland in the morning and here at night! Foot traffic in Disneyland after dark is quite the nightmare.", "upvotes": 0},
                {"text": "Highly recommend World of Color! I see it every time I go :)", "upvotes": 0}
            ],
            "lands": []          
        }
    ],
    "lands": [
        {
            "name": "Fantasyland",
            "description": "description of Fantasyland",
            "imageUrl": "insert image url here",
            "tags": [
                {"text": "I am a tag", "upvotes": 0}
            ],
            "tips": [
                {"text": "I am a pro tip", "upvotes": 0}
            ],
            "rides": [
                {
                    "name": "Mad Tea Party",
                    "description": "description of Mad Tea Party",
                    "imageUrl": "insert image url here",
                    "tags": [
                        {"text": "I am a tag", "upvotes": 0}
                    ],
                    "tips": [
                        {"text": "I am a pro tip", "upvotes": 0}
                    ]
                },
                {
                    "name": "Mr. Toad's Wild Ride",
                    "description": "description of Mr. Toad's Wild Ride",
                    "imageUrl": "insert image url here",
                    "tags": [
                        {"text": "I am a tag", "upvotes": 0}
                    ],
                    "tips": [
                        {"text": "I am a pro tip", "upvotes": 0}
                    ]
                }
            ],
            "dining": [
                {
                    "name": "Red Rose Taverne",
                    "description": "description of Red Rose Taverne",
                    "imageUrl": "insert image url here",
                    "tags": [
                        {"text": "I am a tag", "upvotes": 0}
                    ],
                    "tips": [
                        {"text": "I am a pro tip", "upvotes": 0}
                    ]
                }
            ],
            "shops": [
                {
                    "name": "The Mad Hatter",
                    "description": "description of The Mad Hatter",
                    "imageUrl": "insert image url here",
                    "tags": [
                        {"text": "I am a tag", "upvotes": 0}
                    ],
                    "tips": [
                        {"text": "I am a pro tip", "upvotes": 0}
                    ]
                }
            ],
            "shows": [
                {
                    "name": "Mickey and the Magical Map",
                    "description": "description of Mickey and the Magical Map",
                    "imageUrl": "insert image url here",
                    "tags": [
                        {"text": "I am a tag", "upvotes": 0}
                    ],
                    "tips": [
                        {"text": "I am a pro tip", "upvotes": 0}
                    ]
                }
            ]
        }
    ]
}
